---
kind: method
id: M:Autodesk.Revit.DB.IntersectionResultArray.Clear
source: html/d633c968-9a52-c8f5-88f1-ef072b5fd24a.htm
---
# Autodesk.Revit.DB.IntersectionResultArray.Clear Method

Removes every item from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```